andyp1per/ardupilot/libraries/AP_HAL_ChibiOS/hwdef/common/stm32h5_mcuconf.h
/*
    ChibiOS - Copyright (C) 2006..2025 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/*
  this header is modelled on the one for the Nucleo-144 H743 and H573 boards from ChibiOS
 */
#pragma once

#ifndef STM32_LSECLK
#define STM32_LSECLK 32768U
#endif
#ifndef STM32_LSEDRV
#define STM32_LSEDRV                (3U << 3U)
#endif

/*
 * STM32H5xx drivers configuration.
 * The following settings override the default settings present in
 * the various device driver implementation headers.
 * Note that the settings for each driver only have effect if the whole
 * driver is enabled in halconf.h.
 *
 * IRQ priorities:
 * 15...0       Lowest...Highest.
 *
 * DMA priorities:
 * 0...3        Lowest...Highest.
 */

#define STM32H5xx_MCUCONF
#define STM32H562_MCUCONF
#define STM32H563_MCUCONF
#define STM32H573_MCUCONF

/*
 * HAL driver general settings.
 */
#define STM32_NO_INIT                       FALSE
#define STM32_CLOCK_DYNAMIC                 FALSE

/*
 * ICache settings.
 */
#define STM32_ICACHE_CR                     (ICACHE_CR_EN)
#define STM32_ICACHE_CRR0                   (0U)
#define STM32_ICACHE_CRR1                   (0U)
#define STM32_ICACHE_CRR2                   (0U)
#define STM32_ICACHE_CRR3                   (0U)

/*
 * PWR settings.
 */
#define STM32_PWR_VOSCR                     PWR_VOSCR_VOS_RANGE0
#define STM32_PWR_BDCR                      PWR_BDCR_BREN
#define STM32_PWR_UCPDR                     (0U)
#define STM32_PWR_SCCR                      PWR_SCCR_LDOEN
#define STM32_PWR_VMCR                      (0U)
#define STM32_PWR_USBSCR                    (PWR_USBSCR_USB33SV | PWR_USBSCR_USB33DEN)
#define STM32_PWR_WUCR                      (0U)
#define STM32_PWR_IORETR                    (0U)
#define STM32_PWR_SECCFGR                   (0U)
#define STM32_PWR_PRIVCFGR                  (0U)

/*
 * Clock settings.
 *
 * The STM32H5 series maximum SYSCLK frequency is 250 MHz.
 * The following settings are calculated to achieve this frequency.
 */
#define STM32_LSI_ENABLED                   FALSE
#define STM32_LSE_ENABLED                   TRUE
#define STM32_CSI_ENABLED                   FALSE
#define STM32_HSI48_ENABLED                 TRUE

/*
 * PLL settings based on the HSE clock value.
 */
#if !defined(STM32_HSECLK)
#error "STM32_HSECLK not defined"
#endif

#if (STM32_HSECLK == 0)
/*
 * No external crystal. HSI (64MHz) is used as PLL source.
 * HSICLK = 64MHz / 2 = 32MHz
 * SYSCLK = (32MHz / 4) * 125 / 4 = 250 MHz
 */
#define STM32_HSE_ENABLED                   FALSE
#define STM32_HSI_ENABLED                   TRUE
#define STM32_HSIDIV_VALUE                  2
#define STM32_PLL1SRC                       RCC_PLL1CFGR_PLL1SRC_HSI
#define STM32_PLL1M_VALUE                   4
#define STM32_PLL1N_VALUE                   125
#define STM32_PLL1P_VALUE                   4

#elif (STM32_HSECLK == 8000000)
/*
 * 8MHz crystal.
 * SYSCLK = (8MHz / 2) * 125 / 2 = 250 MHz
 */
#define STM32_HSE_ENABLED                   TRUE
#define STM32_HSI_ENABLED                   FALSE
#define STM32_PLL1SRC                       RCC_PLL1CFGR_PLL1SRC_HSE
#define STM32_PLL1M_VALUE                   2
#define STM32_PLL1N_VALUE                   125
#define STM32_PLL1P_VALUE                   2

#elif (STM32_HSECLK == 16000000)
/*
 * 16MHz crystal.
 * SYSCLK = (16MHz / 4) * 125 / 2 = 250 MHz
 */
#define STM32_HSE_ENABLED                   TRUE
#define STM32_HSI_ENABLED                   FALSE
#define STM32_PLL1SRC                       RCC_PLL1CFGR_PLL1SRC_HSE
#define STM32_PLL1M_VALUE                   4
#define STM32_PLL1N_VALUE                   125
#define STM32_PLL1P_VALUE                   2

#elif (STM32_HSECLK == 24000000)
/*
 * 24MHz crystal.
 */
#define STM32_HSE_ENABLED                   TRUE
#define STM32_HSI_ENABLED                   FALSE
#define STM32_PLL1SRC                       RCC_PLL1CFGR_PLL1SRC_HSE
#ifdef HAL_CUSTOM_MCU_CLOCKRATE
#if (HAL_CUSTOM_MCU_CLOCKRATE == 200000000)
/* SYSCLK = (24MHz / 6) * 100 / 2 = 200 MHz */
#define STM32_PLL1M_VALUE                   6
#define STM32_PLL1N_VALUE                   100
#define STM32_PLL1P_VALUE                   2
#else
#error "Unsupported custom clock rate"
#endif
#else
/* SYSCLK = (24MHz / 6) * 125 / 2 = 250 MHz */
#define STM32_PLL1M_VALUE                   6
#define STM32_PLL1N_VALUE                   125
#define STM32_PLL1P_VALUE                   2
#endif

#elif (STM32_HSECLK == 25000000)
/*
 * 25MHz crystal.
 * SYSCLK = (25MHz / 5) * 100 / 2 = 250 MHz
 */
#define STM32_HSE_ENABLED                   TRUE
#define STM32_HSI_ENABLED                   FALSE
#define STM32_PLL1SRC                       RCC_PLL1CFGR_PLL1SRC_HSE
#define STM32_PLL1M_VALUE                   5
#define STM32_PLL1N_VALUE                   100
#define STM32_PLL1P_VALUE                   2

#elif (STM32_HSECLK == 48000000)
/*
 * 48MHz crystal.
 * SYSCLK = (48MHz / 12) * 125 / 2 = 250 MHz
 */
#define STM32_HSE_ENABLED                   TRUE
#define STM32_HSI_ENABLED                   FALSE
#define STM32_PLL1SRC                       RCC_PLL1CFGR_PLL1SRC_HSE
#define STM32_PLL1M_VALUE                   12
#define STM32_PLL1N_VALUE                   125
#define STM32_PLL1P_VALUE                   2

#else
#error "Unsupported STM32_HSECLK value"
#endif

/*
 * Default PLL1 Q and R values.
 * Can be overridden in board.h.
 */
#ifndef STM32_PLL1Q_VALUE
#define STM32_PLL1Q_VALUE                   4
#endif
#ifndef STM32_PLL1R_VALUE
#define STM32_PLL1R_VALUE                   2
#endif

